Revit 2027 API
Edge.ApproximateLength Property
Returns the approximate length of the edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApproximateLength { get; }
Public ReadOnly Property ApproximateLength As Double
	Get
public:
property double ApproximateLength {
	double get ();
}
member ApproximateLength : float with get
Property Value
Double
Remarks
 Estimates the length of the edge by adding together tessellated segments, Will underestimate when the surface is curved.
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace